<?php

// УСЛОВИЕ:
// Есть 12 идентичных снаружи шаров. 11 из них одинаковые по массе, а один шар -
// аномальный, либо тяжелее, либо легче (это неизвестно). Еще есть сравнительные
// весы, которые бывают только в одном из трех положений: "больше", "меньше", 
// или  "поровну".
// 
// ЗАДАНИЕ:
// Определить аномальный шар за 3 взвешивания.
// ----------------------------------------------------------------------------
// 
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ:
// а) Суммирование массы на рычажке весов, если там лежит 2 или более шаров.
// Функция принимает массив, возвращает сумму значений елементов.
function sum($basin) {
    $sum = 0;
    foreach ($basin as $ball) {
        $sum = $sum + $ball;
    }
    return $sum;
}

// б) Симуляция взвешивания.
// Функция принимает 2 значения (массы левого и правого рычага), сравнивает их, 
// возвращает соответствующий результат.
function compare($leftBasin, $rightBasin) {
    if (count($leftBasin) !== count($rightBasin)) {
        echo "Not equal qty of balls!";
    } else {
        if (is_array($leftBasin) && is_array($rightBasin)) {
            $leftBasin = sum($leftBasin);
            $rightBasin = sum($rightBasin);
        }
        if ($leftBasin < $rightBasin) {
            return '<';
        } elseif ($leftBasin > $rightBasin) {
            return '>';
        } else {
            return '=';
        }
    }
}

// РЕШЕНИЕ:
// 1. Задаем 12 одинаковвых по массе шаров.
for ($ball = array(), $i = 1; count($ball) !== 12; $i++) {
    $ball[$i] = 0.5;
}

// 2. Задаем алгоритм взвешиваний.
// Функция принимает массив с шариками, возвращает 
function scalings($ball) {

    // Первое взвешивание. Сравниваем [1+2+3+4] с [5+6+7+8].
    $step1 = compare(array($ball[1], $ball[2], $ball[3], $ball[4]), array($ball[5], $ball[6], $ball[7], $ball[8]));
    switch ($step1) {

        // Если [1+2+3+4] = [5+6+7+8]...
        case '=':

            // Второе взвешивание. Сравниваем [1+2] с [9+10].
            $step2a = compare(array($ball[1], $ball[2]), array($ball[9], $ball[10]));

            // Если [1+2] = [9+10]...
            if ($step2a == '=') {

                // Третье взвешивание. Сравниваем [11] с [1].
                $step3a = compare($ball[11], $ball[1]);

                // Если [1] = [11]...
                if ($step3a == '=') {

                    // 12й шар - аномальный.
                    $result = 12;
                }

                // Если [1] != [11]...
                else {

                    // 11й шар - аномальный.
                    $result = 11;
                }
            }

            // Если [1+2] != [9+10]...
            else {

                // Третье взвешивание. Сравниваем [9] с [1].
                $step3b = compare($ball[9], $ball[1]);

                // Если [9] = [1]...
                if ($step3b == '=') {

                    // 10й шар - аномальный.
                    $result = 10;

                    // Если [9] != [1]...
                } else {

                    // 9й шар - аномальный.
                    $result = 9;
                }
            }
            break;

        // Если [1+2+3+4] < [5+6+7+8]...
        case '<':

            // Второе взвешивание. Сравниваем [1+2+7] с [3+4+5].
            $step2b = compare(array($ball[1], $ball[2], $ball[7]), array($ball[3], $ball[4], $ball[5]));
            switch ($step2b) {

                // Если [1+2+7] = [3+4+5]...
                case '=':

                    // Третье взвешивание. Сравниваем [6] с [9].
                    $step3c = compare($ball[6], $ball[9]);

                    // Если [6] = [9]...
                    if ($step3c == '=') {

                        // 8й шар - аномальный.
                        $result = 8;
                    }

                    // Если [6] != [9]...
                    else {

                        // 6й шар - аномальный.
                        $result = 6;
                    }
                    break;

                // Если [1+2+7] < [3+4+5]...
                case '<':

                    // Третье взвешивание. Сравниваем [1+5] с [9+10]...
                    $step3d = compare(array($ball[1], $ball[5]), array($ball[9], $ball[10]));
                    switch ($step3d) {

                        // Если [1+5] = [9+10]...
                        case '=':

                            // 2й шар - аномальный.
                            $result = 2;
                            break;

                        // Если [1+5] < [9+10]...
                        case '<':

                            // 1й шар - аномальный.
                            $result = 1;
                            break;

                        // Если [1+5] > [9+10]...
                        case '>':

                            // 5й шар - аномальный.
                            $result = 5;
                            break;
                    }
                    break;

                // Если [1+2+7] > [3+4+5]...
                case '>':

                    // Третье взвешивание. Сравниваем [3+7] с [9+10]...
                    $step3e = compare(array($ball[3], $ball[7]), array($ball[9], $ball[10]));
                    switch ($step3e) {

                        // Если [3+7] = [9+10]...
                        case '=':

                            // 4й шар - аномальный.
                            $result = 4;
                            break;

                        // Если [3+7] < [9+10]...
                        case '<':

                            // 3й шар - аномальный.
                            $result = 3;
                            break;

                        // Если [3+7] > [9+10]...
                        case '>':

                            // 7й шар - аномальный.
                            $result = 7;
                            break;
                    }
                    break;
            }
            break;

        // Если [1+2+3+4] > [5+6+7+8].
        case '>':

            // Второе взвешивание. Сравниваем [1+2+7] с [3+4+5].
            $step2c = compare(array($ball[1], $ball[2], $ball[7]), array($ball[3], $ball[4], $ball[5]));
            switch ($step2c) {

                // Если [1+2+7] = [3+4+5]...
                case '=':

                    // Третье взвешивание. Сравниваем [6] с [9].
                    $step3f = compare($ball[6], $ball[9]);

                    // Если [6] = [9]...
                    if ($step3f == '=') {

                        // 8й шар - аномальный.
                        $result = 8;
                    }

                    // Если [6] != [9]...
                    else {

                        // 6й шар - аномальный.
                        $result = 6;
                    }
                    break;

                // Если [1+2+7] < [3+4+5]...
                case '<':

                    // Третье взвешивание. Сравниваем [3+7] с [9+10].
                    $step3g = compare(array($ball[3], $ball[7]), array($ball[9], $ball[10]));
                    switch ($step3g) {

                        // Если [3+7] = [9+10]...
                        case '=':

                            // 4й шар - аномальный.
                            $result = 4;
                            break;

                        // Если [3+7] < [9+10]...
                        case '<':

                            // 7й шар - аномальный.
                            $result = 7;
                            break;

                        // Если [3+7] > [9+10]...
                        case '>':

                            // 3й шар - аномальный.
                            $result = 3;
                            break;
                    }
                    break;

                // Если [1+2+7] > [3+4+5]...
                case '>':

                    // Третье взвешивание. Сравниваем [2+5] с [9+10].
                    $step3h = compare(array($ball[2], $ball[5]), array($ball[9], $ball[10]));
                    switch ($step3h) {

                        // Если [2+5] = [9+10]...
                        case '=':

                            // 1й шар - аномальный.
                            $result = 1;
                            break;

                        // Если [2+5] < [9+10]...
                        case '<':

                            // 5й шар - аномальный.
                            $result = 5;
                            break;

                        // Если [2+5] > [9+10]...
                        case '>':

                            // 2й шар - аномальный.
                            $result = 2;
                            break;
                    }
                    break;
            }
            break;
    }
    return $result;
}

// 3. Делаем проверку для всех вариантов условий: каждый шар проверяем и для 
// случая, когда он легче остальных, и для случая, когда он тяжелее остальных.
// Выводим результаты.

for ($i = 1; $i < count($ball); $i++) {
    for ($mass = 0; $mass < 2; $mass++) {
        $ball[$i] = $mass;
        if (scalings($ball) !== $i) {
            echo 'The logic is incorrect for ball # ' . $i . ' and mass = ' . $mass;
        } else {
            echo 'The logic is correct for ball # ' . $i . ' and mass = ' . $mass;
        }
    }
    $ball[$i] = 0.5;
}